app/views/rooms/index.html.erb

SELECT COUNT(*) FROM "chats" WHERE "chats"."room_id" = $1  [["room_id", 1]]
---
                  <span><i class="bi bi-chat-dots"></i> <%= room.name %></span>
                  <span class="badge bg-primary rounded-pill ms-2"><%= room.chats.count %> messages</span>