app/controllers/chats_controller.rb

INSERT INTO "chats" ("message", "username", "created_at", "updated_at", "room_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["message", "test"], ["username", "fauzaan"], ["created_at", "2025-10-24 11:53:27.154700"], ["updated_at", "2025-10-24 11:53:27.154700"], ["room_id", 1]]
---
  def create
    @chat = @room.chats.new(chat_params)

    respond_to do |format|
      if @chat.save

SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_room
      @room = Room.find(params[:room_id])