app/controllers/rooms_controller.rb

SELECT "chats".* FROM "chats" WHERE "chats"."room_id" = $1 ORDER BY "chats"."created_at" ASC  [["room_id", 1]]
---
  def show
    @chats = @room.chats.order(created_at: :asc)

INSERT INTO "rooms" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "test"], ["created_at", "2025-10-24 11:53:14.522994"], ["updated_at", "2025-10-24 11:53:14.522994"]]
---
  def create
    @room = Room.new(room_params)

    respond_to do |format|
      if @room.save